app/controllers/alphabets_controller.rb

  def index
      headers['Access-Control-Allow-Origin'] = '*'
      render json: Alphabet.all
---
SELECT "alphabets".* FROM "alphabets"