app/controllers/games_controller.rb

  def word_match
    words = Word.all
---
SELECT "words".* FROM "words"