app/controllers/words_controller.rb

SELECT "words".* FROM "words"
---
  def index
    headers['Access-Control-Allow-Origin'] = '*'
    render json: Word.all

SELECT  "words".* FROM "words" WHERE "words"."character" = $1 AND "words"."id" = $2 LIMIT $3  [["character", "B"], ["id", 572], ["LIMIT", 1]]
---
  def show
    headers['Access-Control-Allow-Origin'] = '*'
    @words = Word.where(character: params[:character].upcase)