app/controllers/words_controller.rb

  def show
    @word = Word.find(params[:id])
---
SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]